cesanta/mongoose/examples/nxp/frdm-mcxn947-xpresso-freertos-builtin/drivers/fsl_spc.c
        /* Set DCDC configuration previously. */
#if (defined(FSL_FEATURE_MCX_SPC_HAS_DCDC) && FSL_FEATURE_MCX_SPC_HAS_DCDC)
        status = SPC_SetActiveModeDCDCRegulatorConfig(base, &config->DCDCOption);
#endif /* FSL_FEATURE_MCX_SPC_HAS_DCDC */
        if (status == kStatus_Success)
        {
            /* Configure CORE LDO after DCDC is configured successfully. */
            status = SPC_SetActiveModeCoreLDORegulatorConfig(base, &config->CoreLDOOption);
        }
        else
        {
            return status;
        }
    }
    else
    {
        /* If want to switch to lower/same voltage level. */

        /* Set LDO configuration previously. */
        status = SPC_SetActiveModeCoreLDORegulatorConfig(base, &config->CoreLDOOption);
#if (defined(FSL_FEATURE_MCX_SPC_HAS_DCDC) && FSL_FEATURE_MCX_SPC_HAS_DCDC)
        if (status == kStatus_Success)
        {
            /* Configure DCDC after CORE_LDO is configured successfully. */
            status = SPC_SetActiveModeDCDCRegulatorConfig(base, &config->DCDCOption);
        }
        else
        {
            return status;
        }
#endif /* FSL_FEATURE_MCX_SPC_HAS_DCDC */
    }

    if (status == kStatus_Success)
    {
#if (defined(FSL_FEATURE_MCX_SPC_HAS_SYS_LDO) && FSL_FEATURE_MCX_SPC_HAS_SYS_LDO)
        status = SPC_SetActiveModeSystemLDORegulatorConfig(base, &config->SysLDOOption);
#endif /* FSL_FEATURE_MCX_SPC_HAS_SYS_LDO */
        if (status == kStatus_Success)
        {
            if (bandgapConfigured == false)
            {
                status = SPC_SetActiveModeBandgapModeConfig(base, config->bandgapMode);
            }
#if (defined(FSL_FEATURE_MCX_SPC_HAS_LPBUFF_EN_BIT) && FSL_FEATURE_MCX_SPC_HAS_LPBUFF_EN_BIT)
            if (status == kStatus_Success)
            {
                SPC_EnableActiveModeCMPBandgapBuffer(base, config->lpBuff);
            }
#endif /* FSL_FEATURE_MCX_SPC_HAS_LPBUFF_EN_BIT */
        }
    }
    return status;
}

/*!
 * brief Configs regulators in Low Power mode.
 *
 * This function provides the method to config all on-chip regulators in Low Power mode.
 *
 * param base SPC peripheral base address.
 * param config Pointer to spc_lowpower_mode_regulators_config_t structure.
 * retval kStatus_Success Config regulators in Low power mode successful.
 * retval kStatus_SPC_BandgapModeWrong The bandgap mode setting in Low Power mode is wrong.
 * retval kStatus_SPC_Busy The SPC instance is busy to execute any type of power mode transition.
 * retval kStatus_SPC_CORELDOVoltageWrong The selected voltage level is wrong.
 * retval kStatus_SPC_CORELDOLowDriveStrengthIgnore Set driver strength to low will be ignored.
 * retval kStatus_SPC_CORELDOVoltageSetFail. Fail to change Core LDO voltage level.
 * retval kStatus_SPC_SYSLDOLowDriveStrengthIgnore Set driver strength to low will be ignored.
 * retval kStatus_SPC_DCDCPulseRefreshModeIgnore Set driver strength to Pulse Refresh mode will be ignored.
 * retval kStatus_SPC_DCDCLowDriveStrengthIgnore Set driver strength to Low Drive Strength will be ignored.
 */
status_t SPC_SetLowPowerModeRegulatorsConfig(SPC_Type *base, const spc_lowpower_mode_regulators_config_t *config)
{
    assert(config != NULL);

    status_t status = kStatus_Success;
    bool bandgapConfigured = false;
    spc_bandgap_mode_t curBandgapMode = SPC_GetActiveModeBandgapMode(base);

#if (defined(FSL_FEATURE_MCX_SPC_HAS_DCDC) && FSL_FEATURE_MCX_SPC_HAS_DCDC)
    if (((config->DCDCOption.DCDCDriveStrength) == kSPC_DCDC_NormalDriveStrength) && (bandgapConfigured == false))
    {
        if (curBandgapMode == kSPC_BandgapDisabled)
        {
            if ((config->bandgapMode) == kSPC_BandgapDisabled)
            {
                /* Bandgap must be enabled if any regulator attemp to work as normal drive strength. */
                return kStatus_SPC_BandgapModeWrong;
            }
            else
            {
                /* Set bandgap firstly, if current bandgap is disabled and attempt to set regulator as normal drive
                  strength. */
                base->LP_CFG = ((base->LP_CFG) & (~SPC_LP_CFG_BGMODE_MASK)) | SPC_LP_CFG_BGMODE(config->bandgapMode);
                bandgapConfigured = true;
            } 
        }
    }
#endif /* FSL_FEATURE_MCX_SPC_HAS_DCDC */

    if (((config->CoreLDOOption.CoreLDODriveStrength) == kSPC_CoreLDO_NormalDriveStrength) && (bandgapConfigured == false))
    {
        if (curBandgapMode == kSPC_BandgapDisabled)
        {
            if ((config->bandgapMode) == kSPC_BandgapDisabled)
            {
                /* Bandgap must be enabled if any regulator attemp to work as normal drive strength. */
                return kStatus_SPC_BandgapModeWrong;
            }
            else
            {
                /* Set bandgap firstly, if current bandgap is disabled and attempt to set regulator as normal drive
                  strength. */
                base->LP_CFG = ((base->LP_CFG) & (~SPC_LP_CFG_BGMODE_MASK)) | SPC_LP_CFG_BGMODE(config->bandgapMode);
                bandgapConfigured = true;
            } 
        }
    }

#if (defined(FSL_FEATURE_MCX_SPC_HAS_SYS_LDO) && FSL_FEATURE_MCX_SPC_HAS_SYS_LDO)
    if (((config->SysLDOOption.SysLDODriveStrength) == kSPC_SysLDO_NormalDriveStrength) && (bandgapConfigured == false))
    {
        if (curBandgapMode == kSPC_BandgapDisabled)
        {
            if ((config->bandgapMode) == kSPC_BandgapDisabled)
            {
                /* Bandgap must be enabled if any regulator attemp to work as normal drive strength. */
                return kStatus_SPC_BandgapModeWrong;
            }
            else
            {
                /* Set bandgap firstly, if current bandgap is disabled and attempt to set regulator as normal drive
                  strength. */
                base->LP_CFG = ((base->LP_CFG) & (~SPC_LP_CFG_BGMODE_MASK)) | SPC_LP_CFG_BGMODE(config->bandgapMode);
                bandgapConfigured = true;
            } 
        }
    }
#endif /* FSL_FEATURE_MCX_SPC_HAS_SYS_LDO */

#if (defined(FSL_FEATURE_MCX_SPC_HAS_DCDC) && FSL_FEATURE_MCX_SPC_HAS_DCDC)
    if ((uint8_t)config->DCDCOption.DCDCVoltage != (uint8_t)config->CoreLDOOption.CoreLDOVoltage)
    {
        /* Must specify the same level for both DCDC and CORE LDO, even if LDO_CORE is off. */
        return kStatus_SPC_CORELDOVoltageWrong;
    }
#endif /* FSL_FEATURE_MCX_SPC_HAS_DCDC */

    status = SPC_SetLowPowerModeCoreLDORegulatorConfig(base, &config->CoreLDOOption);
    if (status == kStatus_Success)
    {
#if (defined(FSL_FEATURE_MCX_SPC_HAS_SYS_LDO) && FSL_FEATURE_MCX_SPC_HAS_SYS_LDO)
        status = SPC_SetLowPowerModeSystemLDORegulatorConfig(base, &config->SysLDOOption);
#endif /* FSL_FEATURE_MCX_SPC_HAS_SYS_LDO */
        if (status == kStatus_Success)
        {
#if (defined(FSL_FEATURE_MCX_SPC_HAS_DCDC) && FSL_FEATURE_MCX_SPC_HAS_DCDC)
            status = SPC_SetLowPowerModeDCDCRegulatorConfig(base, &config->DCDCOption);
#endif /* FSL_FEATURE_MCX_SPC_HAS_DCDC */
            if (status == kStatus_Success)
            {
                if (bandgapConfigured == false)
                {
                    status = SPC_SetLowPowerModeBandgapmodeConfig(base, config->bandgapMode);
                }
                if (status == kStatus_Success)
                {
#if (defined(FSL_FEATURE_MCX_SPC_HAS_LPBUFF_EN_BIT) && FSL_FEATURE_MCX_SPC_HAS_LPBUFF_EN_BIT)
                    SPC_EnableLowPowerModeCMPBandgapBufferMode(base, config->lpBuff);
#endif /* FSL_FEATURE_MCX_SPC_HAS_LPBUFF_EN_BIT */
                    SPC_EnableLowPowerModeLowPowerIREF(base, config->lpIREF);
#if (defined(FSL_FEATURE_MCX_SPC_HAS_COREVDD_IVS_EN_BIT) && FSL_FEATURE_MCX_SPC_HAS_COREVDD_IVS_EN_BIT)
                    SPC_EnableLowPowerModeCoreVDDInternalVoltageScaling(base, config->CoreIVS);
#endif /* FSL_FEATURE_MCX_SPC_HAS_COREVDD_IVS_EN_BIT */
                }
            }
        }
    }

    return status;
}
